CraftifAI/Firmgen/ti_c2000_sdk/driverlib/f28p65x/examples/c28x_dual/flash_kernel/flash_kernel_c28x_dual_ex1_boot_cpu1.c
//###########################################################################
//
// FILE:    flash_kernel_c28x_dual_ex1_boot_cpu1.c
//
// TITLE:   Boot Source Code
//! <h1> Boot Source Code </h1>
//! Functions:
//!
//!     void   copyData(void)
//!     uint32_t getLongData(void)
//!     void readReservedFn(void)
//
//###########################################################################
// 
// C2000Ware v6.00.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

//
// Included Files
//

#include "flash_programming_f28p65x.h" // Flash API example header file
#include "cpu1bootrom.h"
#include "FlashTech_F28P65x_C28x.h"
#include "f28p65x_kernel_commands_cpu1.h"
#include <assert.h>

//
// Defines
//

#define BUFFER_SIZE                 0x80 // Must be a multiple
                                         // of 128 bits, or 8 words,
                                         // BUFFER_SIZE % 8 == 0

//
// Globals
//
extern uint16fptr getWordData;  // getWordData is a pointer to the function that
                                // interfaces to the peripheral. Each loader assigns
                                // this pointer to it's particular GetWordData
                                // function.

typedef struct
{
   uint16_t status;
   uint32_t address;
   uint16_t flashAPIError;
   uint32_t flashAPIFsmStatus;
}  StatusCode;
extern StatusCode statusCode;

//
// 128 sectors (8x16)
//
unsigned char erasedAlready[] = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};

//
// Function Prototypes
//
extern void sciSendChecksum(void);
uint32_t getLongData(void);
void copyData(void);
void readReservedFn(void);
uint32_t findSector(uint32_t address);
uint16_t findSize(uint32_t address);
void setFlashAPIError(Fapi_StatusType status);
void exampleError(Fapi_StatusType status);

//
// copyData - This routine copies multiple blocks of data from the host
//            to the specified RAM locations.  There is no error
//            checking on any of the destination addresses.
//            That is it is assumed all addresses and block size
//            values are correct.
//
//            Multiple blocks of data are copied until a block
//            size of 00 00 is encountered.
//
void copyData()
{
    struct HEADER
    {
        uint16_t BlockSize;
        uint32_t DestAddr;
    } BlockHeader;

    uint16_t Buffer[BUFFER_SIZE];

    //
    // useful for 8-word access to flash with
    //
    uint16_t miniBuffer[8];
    uint16_t i = 0;
    uint16_t j = 0;
    uint16_t k = 0;
    uint32_t sectorAddress;
    uint16_t sectorSize;
    uint16_t wordData;
    uint16_t wordsWritten = 0;
    int fail = 0;

    assert(BUFFER_SIZE % 8 == 0);

    if (statusCode.status != NO_ERROR)
    {
        fail++;
    }

    //
    // Reset erase status of all flash sectors
    // 36 sectors.
    //
    for (i = 0; i < 32; i++)
    {
        erasedAlready[i] = 0;
    }

    //
    // Send checksum to satisfy before we begin
    //
#if checksum_enable
    sciSendChecksum();
#endif

    //
    // Get the size in words of the first block
    //
    BlockHeader.BlockSize = (*getWordData)();

    //
    // While the block size is > 0 copy the data
    // to the DestAddr.  There is no error checking
    // as it is assumed the DestAddr is a valid
    // memory location
    //

    EALLOW;
    while (BlockHeader.BlockSize != (uint16_t) 0x0000)
    {
        Fapi_StatusType oReturnCheck;
        Fapi_FlashStatusWordType oFlashStatusWord;
        Fapi_FlashStatusType oFlashStatus;

        BlockHeader.DestAddr = getLongData();
        for (i = 0; i < BlockHeader.BlockSize; i += 0)
        {
            if (BlockHeader.BlockSize < BUFFER_SIZE)
            {
                for (j = 0; j < BlockHeader.BlockSize; j++)
                {
                    wordData = (*getWordData)();
                    Buffer[j] = wordData;
                    i++;
                }
                for (j = BlockHeader.BlockSize; j < BUFFER_SIZE; j++)
                {
                    Buffer[j] = 0xFFFF;
                }
            }

            //
            // BlockHeader.BlockSize >= BUFFER_SIZE
            //
            else
            {
                //
                // less than one BUFFER_SIZE left
                //
                if ((BlockHeader.BlockSize - i) < BUFFER_SIZE)
                {
                    //
                    // fill Buffer with rest of data
                    //
                    for (j = 0; j < BlockHeader.BlockSize - i; j++)
                    {
                        wordData = (*getWordData)();
                        Buffer[j] = wordData;
                    }

                    //
                    // increment i outside here so it doesn't affect loop above
                    //
                    i += j;

                    //
                    // fill the rest with 0xFFFF
                    //
                    for (; j < BUFFER_SIZE; j++)
                    {
                        Buffer[j] = 0xFFFF;
                    }
                }
                else
                {
                    //
                    // fill up like normal, up to BUFFER_SIZE
                    //
                    for (j = 0; j < BUFFER_SIZE; j++)
                    {
                        wordData = (*getWordData)();
                        Buffer[j] = wordData;
                        i++;
                    }
                }
            }
            for (k = 0; k < (BUFFER_SIZE / 8); k++)
            {
                miniBuffer[0] = Buffer[k * 8 + 0];
                miniBuffer[1] = Buffer[k * 8 + 1];
                miniBuffer[2] = Buffer[k * 8 + 2];
                miniBuffer[3] = Buffer[k * 8 + 3];
                miniBuffer[4] = Buffer[k * 8 + 4];
                miniBuffer[5] = Buffer[k * 8 + 5];
                miniBuffer[6] = Buffer[k * 8 + 6];
                miniBuffer[7] = Buffer[k * 8 + 7];

                //
                // check that all the words have not already been written
                //
                if (wordsWritten < BlockHeader.BlockSize)
                {
                    if(fail == 0)
                    {
                        //
                        // clean out flash banks if needed
                        //
                        sectorAddress = findSector(BlockHeader.DestAddr);
                        if (sectorAddress != 0xdeadbeef)
                        {
                            //
                            // FindSize returns size of sector in 32 bit words.
                            //
                            sectorSize = findSize(sectorAddress);
                            //
                            // Wait until FSM is done with the previous flash operation
                            //
                            while (Fapi_checkFsmForReady() != Fapi_Status_FsmReady){}
                            oFlashStatus = Fapi_getFsmStatus();
                            if(oFlashStatus != 0)
                            {

                                /* Clear the Status register */
                                oReturnCheck = Fapi_issueAsyncCommand(Fapi_ClearStatus);
                                //
                                // Wait until status is cleared
                                //
                                while (Fapi_getFsmStatus() != 0) {}

