CraftifAI/Firmgen/ti_c2000_sdk/driverlib/f28p65x/examples/c28x_dual/flash_kernel/flash_kernel_c28x_dual_ex1_boot_cpu1.c
                                if(oReturnCheck != Fapi_Status_Success)
                                {
                                statusCode.status = CLEAR_STATUS_ERROR;
                                statusCode.address = 0;
                                setFlashAPIError(oReturnCheck);
                                statusCode.flashAPIFsmStatus = 0; // not used here
                                fail++;
                                }
                            }
                            //
                            // Disable erase/program protection
                            // CMDWEPROTA is applicable for sectors 0-31
                            // Bits 0-11 of CMDWEPROTB is applicable for sectors 32-127, each bit represents
                            // a group of 8 sectors, e.g bit 0 represents sectors 32-39, bit 1 represents
                            // sectors 40-47, etc
                            //
                            Fapi_setupBankSectorEnable(FLASH_WRAPPER_PROGRAM_BASE+FLASH_O_CMDWEPROTA, 0);
                            Fapi_setupBankSectorEnable(FLASH_WRAPPER_PROGRAM_BASE+FLASH_O_CMDWEPROTB, 0);

                            oReturnCheck = Fapi_issueAsyncCommandWithAddress(
                                    Fapi_EraseSector, (uint32_t *) sectorAddress);

                            while (Fapi_checkFsmForReady() != Fapi_Status_FsmReady){}

                            oFlashStatus = Fapi_getFsmStatus();

                            oReturnCheck = Fapi_doBlankCheck(
                                    (uint32_t *) sectorAddress, sectorSize,
                                    &oFlashStatusWord);
                            if (oReturnCheck != Fapi_Status_Success || oFlashStatus != 3)
                            {
                                //
                                //first fail
                                //
                                if (fail == 0)
                                {
                                    statusCode.status = BLANK_ERROR;
                                    statusCode.address =
                                            oFlashStatusWord.au32StatusWord[0];
                                    setFlashAPIError(oReturnCheck);
                                    statusCode.flashAPIFsmStatus = oFlashStatus;
                                }
                                fail++;
                            }
                        }
                    }
                    if(fail == 0)
                    {
                        //
                        // Wait until FSM is done with the previous flash operation
                        //
                        while (Fapi_checkFsmForReady() != Fapi_Status_FsmReady){}
                        oFlashStatus = Fapi_getFsmStatus();
                        if(oFlashStatus != 0)
                        {

                            /* Clear the Status register */
                            oReturnCheck = Fapi_issueAsyncCommand(Fapi_ClearStatus);
                            //
                            // Wait until status is cleared
                            //
                            while (Fapi_getFsmStatus() != 0) {}

                            if(oReturnCheck != Fapi_Status_Success)
                            {
                            statusCode.status = CLEAR_STATUS_ERROR;
                            statusCode.address = 0;
                            setFlashAPIError(oReturnCheck);
                            statusCode.flashAPIFsmStatus = 0; // not used here
                            fail++;
                            }
                        }
                        //
                        // Disable erase/program protection
                        // Bits 0-11 of CMDWEPROTB is applicable for sectors 32-127, each bit represents
                        // a group of 8 sectors, e.g bit 0 represents sectors 32-39, bit 1 represents
                        // sectors 40-47, etc
                        //
                       Fapi_setupBankSectorEnable(FLASH_WRAPPER_PROGRAM_BASE+FLASH_O_CMDWEPROTA, 0);
                       Fapi_setupBankSectorEnable(FLASH_WRAPPER_PROGRAM_BASE+FLASH_O_CMDWEPROTB, 0);
                        //
                        //program 8 words at once, 128-bits
                        //
                        oReturnCheck = Fapi_issueProgrammingCommand(
                                (uint32_t *) BlockHeader.DestAddr, miniBuffer,
                                sizeof(miniBuffer), 0, 0, Fapi_AutoEccGeneration);

                        while (Fapi_checkFsmForReady() == Fapi_Status_FsmBusy);

                        oFlashStatus = Fapi_getFsmStatus();
                        if (oReturnCheck != Fapi_Status_Success || oFlashStatus != 3)
                        {
                            //
                            // first fail
                            //
                            if (fail == 0)
                            {
                                statusCode.status = PROGRAM_ERROR;
                                statusCode.address =
                                        BlockHeader.DestAddr;
                                setFlashAPIError(oReturnCheck);
                                statusCode.flashAPIFsmStatus = oFlashStatus;
                            }
                            fail++;
                        }
                    }
                    for (j = 0; j < 8; j += 2)
                    {
                        uint32_t toVerify = miniBuffer[j + 1];
                        toVerify = toVerify << 16;
                        toVerify |= miniBuffer[j];
                        if(fail == 0)
                        {
                            oReturnCheck = Fapi_doVerify(
                                    (uint32_t *) (BlockHeader.DestAddr + j), 1,
                                    (uint32_t *) (&toVerify), &oFlashStatusWord);
                            if (oReturnCheck != Fapi_Status_Success)
                            {
                                //
                                // first fail
                                //
                                if (fail == 0)
                                {
                                    statusCode.status = VERIFY_ERROR;
                                    statusCode.address =
                                            oFlashStatusWord.au32StatusWord[0];
                                    setFlashAPIError(oReturnCheck);
                                    //
                                    // FMSTAT not checked for Verify
                                    //
                                    statusCode.flashAPIFsmStatus = 0;
                                }
                                fail++;
                            }
                        }
                    } //for j; for Fapi_doVerify
                } //check if all the words are not already written
                BlockHeader.DestAddr += 0x8;
                wordsWritten += 0x8;
            } //for(int k); loads miniBuffer with Buffer elements
#if checksum_enable
            sciSendChecksum();
#endif
        }
        //
        // get the size of the next block
        //
        BlockHeader.BlockSize = (*getWordData)();
        wordsWritten = 0;
    }
    EDIS;
    return;
}


//
// uint32_t findSector(uint32_t address) - This routine finds what sector the mentioned address
//                                         is a part of.
//
uint32_t findSector(uint32_t address)
{
    if((address >= Bzero_Sector0_start) && (address < Bzero_Sector1_start) &&
       (erasedAlready[0] == 0))
    {
        erasedAlready[0] = 1;
        return (uint32_t)Bzero_Sector0_start;
    }
    else if((address >= Bzero_Sector1_start) &&
            (address < Bzero_Sector2_start) && (erasedAlready[1] == 0))
    {
        erasedAlready[1] = 1;
        return (uint32_t)Bzero_Sector1_start;
    }
    else if((address >= Bzero_Sector2_start) &&
            (address < Bzero_Sector3_start) && (erasedAlready[2] == 0))
    {
        erasedAlready[2] = 1;
        return (uint32_t)Bzero_Sector2_start;
    }
    else if((address >= Bzero_Sector3_start) &&
            (address < Bzero_Sector4_start) && (erasedAlready[3] == 0))
    {
        erasedAlready[3] = 1;
        return (uint32_t)Bzero_Sector3_start;
    }
    else if((address >= Bzero_Sector4_start) &&
            (address < Bzero_Sector5_start) && (erasedAlready[4] == 0))
    {
        erasedAlready[4] = 1;
        return (uint32_t)Bzero_Sector4_start;
    }
    else if((address >= Bzero_Sector5_start) &&
            (address < Bzero_Sector6_start) && (erasedAlready[5] == 0))
    {
        erasedAlready[5] = 1;
        return (uint32_t)Bzero_Sector5_start;
    }
    else if((address >= Bzero_Sector6_start) &&
            (address < Bzero_Sector7_start) && (erasedAlready[6] == 0))
    {
        erasedAlready[6] = 1;
        return (uint32_t)Bzero_Sector6_start;
    }
    else if((address >= Bzero_Sector7_start) &&
            (address < Bzero_Sector8_start) && (erasedAlready[7] == 0))
    {
        erasedAlready[7] = 1;
        return (uint32_t)Bzero_Sector7_start;
    }
    else if((address >= Bzero_Sector8_start) &&
            (address < Bzero_Sector9_start) && (erasedAlready[8] == 0))
    {
        erasedAlready[8] = 1;
        return (uint32_t)Bzero_Sector8_start;
    }
    else if((address >= Bzero_Sector9_start) &&
            (address < Bzero_Sector10_start) && (erasedAlready[9] == 0))
    {
        erasedAlready[9] = 1;
        return (uint32_t)Bzero_Sector9_start;
    }
    else if((address >= Bzero_Sector10_start) &&
            (address < Bzero_Sector11_start) && (erasedAlready[10] == 0))
    {
        erasedAlready[10] = 1;
        return (uint32_t)Bzero_Sector10_start;
    }
    else if((address >= Bzero_Sector11_start) &&
            (address < Bzero_Sector12_start) && (erasedAlready[11] == 0))
    {
        erasedAlready[11] = 1;
        return (uint32_t)Bzero_Sector11_start;
    }
    else if((address >= Bzero_Sector12_start) &&
            (address < Bzero_Sector13_start) && (erasedAlready[12] == 0))
    {
        erasedAlready[12] = 1;
        return (uint32_t)Bzero_Sector12_start;
    }
    else if((address >= Bzero_Sector13_start) &&
            (address < Bzero_Sector14_start) && (erasedAlready[13] == 0))
    {
        erasedAlready[13] = 1;
        return (uint32_t)Bzero_Sector13_start;
    }
    else if((address >= Bzero_Sector14_start) &&
            (address < Bzero_Sector15_start) && (erasedAlready[14] == 0))
    {
        erasedAlready[14] = 1;
        return (uint32_t)Bzero_Sector14_start;
    }
    else if((address >= Bzero_Sector15_start) &&
            (address < Bzero_Sector16_start) && (erasedAlready[15] == 0))
    {
        erasedAlready[15] = 1;
        return (uint32_t)Bzero_Sector15_start;
    }
    else if((address >= Bzero_Sector16_start) &&
            (address < Bzero_Sector17_start) && (erasedAlready[16] == 0))
    {
        erasedAlready[16] = 1;
        return (uint32_t)Bzero_Sector16_start;
    }
    else if((address >= Bzero_Sector17_start) &&
            (address < Bzero_Sector18_start) && (erasedAlready[17] == 0))
    {
        erasedAlready[17] = 1;
        return (uint32_t)Bzero_Sector17_start;
    }
    else if((address >= Bzero_Sector18_start) &&
            (address < Bzero_Sector19_start) && (erasedAlready[18] == 0))
    {
        erasedAlready[18] = 1;
        return (uint32_t)Bzero_Sector18_start;
    }
    else if((address >= Bzero_Sector19_start) &&
            (address < Bzero_Sector20_start) && (erasedAlready[19] == 0))
    {
        erasedAlready[19] = 1;
        return (uint32_t)Bzero_Sector19_start;
    }
    else if((address >= Bzero_Sector20_start) &&
            (address < Bzero_Sector21_start) && (erasedAlready[20] == 0))
    {
        erasedAlready[20] = 1;
        return (uint32_t)Bzero_Sector20_start;
    }
    else if((address >= Bzero_Sector21_start) &&
            (address < Bzero_Sector22_start) && (erasedAlready[21] == 0))
    {
        erasedAlready[21] = 1;
        return (uint32_t)Bzero_Sector21_start;
    }
    else if((address >= Bzero_Sector22_start) &&
            (address < Bzero_Sector23_start) && (erasedAlready[22] == 0))
    {
        erasedAlready[22] = 1;
        return (uint32_t)Bzero_Sector22_start;
    }
    else if((address >= Bzero_Sector23_start) &&
            (address < Bzero_Sector24_start) && (erasedAlready[23] == 0))
    {
        erasedAlready[23] = 1;
        return (uint32_t)Bzero_Sector23_start;
    }
    else if((address >= Bzero_Sector24_start) &&
            (address < Bzero_Sector25_start) && (erasedAlready[24] == 0))
    {
        erasedAlready[24] = 1;
        return (uint32_t)Bzero_Sector24_start;
    }
    else if((address >= Bzero_Sector25_start) &&
            (address < Bzero_Sector26_start) && (erasedAlready[25] == 0))
    {
        erasedAlready[25] = 1;
        return (uint32_t)Bzero_Sector25_start;
    }
    else if((address >= Bzero_Sector26_start) &&
            (address < Bzero_Sector27_start) && (erasedAlready[26] == 0))
    {
        erasedAlready[26] = 1;
        return (uint32_t)Bzero_Sector26_start;
    }
    else if((address >= Bzero_Sector27_start) &&
            (address < Bzero_Sector28_start) && (erasedAlready[27] == 0))
    {
        erasedAlready[27] = 1;
        return (uint32_t)Bzero_Sector27_start;
    }
    else if((address >= Bzero_Sector28_start) &&
            (address < Bzero_Sector29_start) && (erasedAlready[28] == 0))
    {
        erasedAlready[28] = 1;
        return (uint32_t)Bzero_Sector28_start;
    }
    else if((address >= Bzero_Sector29_start) &&
            (address < Bzero_Sector30_start) && (erasedAlready[29] == 0))
    {
        erasedAlready[29] = 1;
        return (uint32_t)Bzero_Sector29_start;
    }
    else if((address >= Bzero_Sector30_start) &&
            (address < Bzero_Sector31_start) && (erasedAlready[30] == 0))
    {
        erasedAlready[30] = 1;
        return (uint32_t)Bzero_Sector30_start;
    }
    else if((address >= Bzero_Sector31_start) &&
            (address < Bzero_Sector32_start) && (erasedAlready[31] == 0))
    {
        erasedAlready[31] = 1;
        return (uint32_t)Bzero_Sector31_start;
    }
    else if((address >= Bzero_Sector32_start) &&
            (address < Bzero_Sector33_start) && (erasedAlready[32] == 0))
    {
        erasedAlready[32] = 1;
        return (uint32_t)Bzero_Sector32_start;
    }
    else if((address >= Bzero_Sector33_start) &&
            (address < Bzero_Sector34_start) && (erasedAlready[33] == 0))
    {
        erasedAlready[33] = 1;
        return (uint32_t)Bzero_Sector33_start;
    }
    else if((address >= Bzero_Sector34_start) &&
            (address < Bzero_Sector35_start) && (erasedAlready[34] == 0))
    {
        erasedAlready[34] = 1;
        return (uint32_t)Bzero_Sector34_start;
    }
    else if((address >= Bzero_Sector35_start) &&
            (address < Bzero_Sector36_start) && (erasedAlready[35] == 0))
    {
        erasedAlready[35] = 1;
        return (uint32_t)Bzero_Sector35_start;
    }
    else if((address >= Bzero_Sector36_start) &&
            (address < Bzero_Sector37_start) && (erasedAlready[36] == 0))
    {
        erasedAlready[36] = 1;
        return (uint32_t)Bzero_Sector36_start;
    }
    else if((address >= Bzero_Sector37_start) &&
            (address < Bzero_Sector38_start) && (erasedAlready[37] == 0))
    {
        erasedAlready[37] = 1;
        return (uint32_t)Bzero_Sector37_start;
    }
    else if((address >= Bzero_Sector38_start) &&
            (address < Bzero_Sector39_start) && (erasedAlready[38] == 0))
    {
        erasedAlready[38] = 1;
        return (uint32_t)Bzero_Sector38_start;
    }
    else if((address >= Bzero_Sector39_start) &&
            (address < Bzero_Sector40_start) && (erasedAlready[39] == 0))
    {
        erasedAlready[39] = 1;
        return (uint32_t)Bzero_Sector39_start;
    }
    else if((address >= Bzero_Sector40_start) &&
            (address < Bzero_Sector41_start) && (erasedAlready[40] == 0))
    {
        erasedAlready[40] = 1;
        return (uint32_t)Bzero_Sector40_start;
    }
    else if((address >= Bzero_Sector41_start) &&
            (address < Bzero_Sector42_start) && (erasedAlready[41] == 0))
    {
        erasedAlready[41] = 1;
        return (uint32_t)Bzero_Sector41_start;
    }
    else if((address >= Bzero_Sector42_start) &&
            (address < Bzero_Sector43_start) && (erasedAlready[42] == 0))
    {
        erasedAlready[42] = 1;
        return (uint32_t)Bzero_Sector42_start;
    }
    else if((address >= Bzero_Sector43_start) &&
            (address < Bzero_Sector44_start) && (erasedAlready[43] == 0))
    {
        erasedAlready[43] = 1;
        return (uint32_t)Bzero_Sector43_start;
    }
    else if((address >= Bzero_Sector44_start) &&
            (address < Bzero_Sector45_start) && (erasedAlready[44] == 0))
    {
        erasedAlready[44] = 1;
        return (uint32_t)Bzero_Sector44_start;
    }
    else if((address >= Bzero_Sector45_start) &&
            (address < Bzero_Sector46_start) && (erasedAlready[45] == 0))
    {
        erasedAlready[45] = 1;
        return (uint32_t)Bzero_Sector45_start;
    }
    else if((address >= Bzero_Sector46_start) &&
            (address < Bzero_Sector47_start) && (erasedAlready[46] == 0))
    {
        erasedAlready[46] = 1;
        return (uint32_t)Bzero_Sector46_start;
    }
    else if((address >= Bzero_Sector47_start) &&
            (address < Bzero_Sector48_start) && (erasedAlready[47] == 0))
    {
        erasedAlready[47] = 1;
        return (uint32_t)Bzero_Sector47_start;
    }
    else if((address >= Bzero_Sector48_start) &&
            (address < Bzero_Sector49_start) && (erasedAlready[48] == 0))
    {
        erasedAlready[48] = 1;
        return (uint32_t)Bzero_Sector48_start;
    }
    else if((address >= Bzero_Sector49_start) &&
            (address < Bzero_Sector50_start) && (erasedAlready[49] == 0))
    {
        erasedAlready[49] = 1;
        return (uint32_t)Bzero_Sector49_start;
    }
    else if((address >= Bzero_Sector50_start) &&
            (address < Bzero_Sector51_start) && (erasedAlready[50] == 0))
    {
        erasedAlready[50] = 1;
        return (uint32_t)Bzero_Sector50_start;
    }
    else if((address >= Bzero_Sector51_start) &&
            (address < Bzero_Sector52_start) && (erasedAlready[51] == 0))
    {
        erasedAlready[51] = 1;
        return (uint32_t)Bzero_Sector51_start;
    }
    else if((address >= Bzero_Sector52_start) &&
            (address < Bzero_Sector53_start) && (erasedAlready[52] == 0))
    {
        erasedAlready[52] = 1;
        return (uint32_t)Bzero_Sector52_start;
    }
    else if((address >= Bzero_Sector53_start) &&
            (address < Bzero_Sector54_start) && (erasedAlready[53] == 0))
    {
        erasedAlready[53] = 1;
        return (uint32_t)Bzero_Sector53_start;
    }
    else if((address >= Bzero_Sector54_start) &&
            (address < Bzero_Sector55_start) && (erasedAlready[54] == 0))
    {
        erasedAlready[54] = 1;
        return (uint32_t)Bzero_Sector54_start;
    }
    else if((address >= Bzero_Sector55_start) &&
            (address < Bzero_Sector56_start) && (erasedAlready[55] == 0))
    {
        erasedAlready[55] = 1;
        return (uint32_t)Bzero_Sector55_start;
    }
    else if((address >= Bzero_Sector56_start) &&
            (address < Bzero_Sector57_start) && (erasedAlready[56] == 0))
    {
        erasedAlready[56] = 1;
        return (uint32_t)Bzero_Sector56_start;
    }
    else if((address >= Bzero_Sector57_start) &&
            (address < Bzero_Sector58_start) && (erasedAlready[57] == 0))
    {
        erasedAlready[57] = 1;
        return (uint32_t)Bzero_Sector57_start;
    }
    else if((address >= Bzero_Sector58_start) &&
            (address < Bzero_Sector59_start) && (erasedAlready[58] == 0))
    {
        erasedAlready[58] = 1;
        return (uint32_t)Bzero_Sector58_start;
    }
    else if((address >= Bzero_Sector59_start) &&
            (address < Bzero_Sector60_start) && (erasedAlready[59] == 0))
    {
        erasedAlready[59] = 1;
        return (uint32_t)Bzero_Sector59_start;
    }
    else if((address >= Bzero_Sector60_start) &&
            (address < Bzero_Sector61_start) && (erasedAlready[60] == 0))
    {
        erasedAlready[60] = 1;
        return (uint32_t)Bzero_Sector60_start;
    }
    else if((address >= Bzero_Sector61_start) &&
            (address < Bzero_Sector62_start) && (erasedAlready[61] == 0))
    {
        erasedAlready[61] = 1;
        return (uint32_t)Bzero_Sector61_start;
    }
    else if((address >= Bzero_Sector62_start) &&
            (address < Bzero_Sector63_start) && (erasedAlready[62] == 0))
    {
        erasedAlready[62] = 1;
        return (uint32_t)Bzero_Sector62_start;
    }
    else if((address >= Bzero_Sector63_start) &&
            (address < Bzero_Sector64_start) && (erasedAlready[63] == 0))
    {
        erasedAlready[63] = 1;
        return (uint32_t)Bzero_Sector63_start;
    }
    else if((address >= Bzero_Sector64_start) &&
            (address < Bzero_Sector65_start) && (erasedAlready[64] == 0))
    {
        erasedAlready[64] = 1;
        return (uint32_t)Bzero_Sector64_start;
    }
    else if((address >= Bzero_Sector65_start) &&
            (address < Bzero_Sector66_start) && (erasedAlready[65] == 0))
    {
        erasedAlready[65] = 1;
        return (uint32_t)Bzero_Sector66_start;
    }
    else if((address >= Bzero_Sector66_start) &&
            (address < Bzero_Sector67_start) && (erasedAlready[66] == 0))
    {
        erasedAlready[66] = 1;
        return (uint32_t)Bzero_Sector66_start;
    }
    else if((address >= Bzero_Sector67_start) &&
            (address < Bzero_Sector68_start) && (erasedAlready[67] == 0))
    {
        erasedAlready[67] = 1;
        return (uint32_t)Bzero_Sector67_start;
    }
    else if((address >= Bzero_Sector68_start) &&
            (address < Bzero_Sector69_start) && (erasedAlready[68] == 0))
    {
        erasedAlready[68] = 1;
        return (uint32_t)Bzero_Sector68_start;
    }
    else if((address >= Bzero_Sector69_start) &&
            (address < Bzero_Sector70_start) && (erasedAlready[69] == 0))
    {
        erasedAlready[69] = 1;
        return (uint32_t)Bzero_Sector69_start;
    }
    
