CraftifAI/Firmgen/ti_c2000_sdk/driverlib/f28p65x/examples/c28x_dual/flash_kernel/flash_kernel_c28x_dual_ex1_boot_cpu1.c
    else if((address >= Bzero_Sector70_start) &&
            (address < Bzero_Sector71_start) && (erasedAlready[70] == 0))
    {
        erasedAlready[70] = 1;
        return (uint32_t)Bzero_Sector70_start;
    }
    else if((address >= Bzero_Sector71_start) &&
            (address < Bzero_Sector72_start) && (erasedAlready[71] == 0))
    {
        erasedAlready[71] = 1;
        return (uint32_t)Bzero_Sector71_start;
    }
    else if((address >= Bzero_Sector72_start) &&
            (address < Bzero_Sector73_start) && (erasedAlready[72] == 0))
    {
        erasedAlready[72] = 1;
        return (uint32_t)Bzero_Sector72_start;
    }
    else if((address >= Bzero_Sector73_start) &&
            (address < Bzero_Sector74_start) && (erasedAlready[73] == 0))
    {
        erasedAlready[73] = 1;
        return (uint32_t)Bzero_Sector73_start;
    }
    else if((address >= Bzero_Sector74_start) &&
            (address < Bzero_Sector75_start) && (erasedAlready[74] == 0))
    {
        erasedAlready[74] = 1;
        return (uint32_t)Bzero_Sector74_start;
    }
    else if((address >= Bzero_Sector75_start) &&
            (address < Bzero_Sector76_start) && (erasedAlready[75] == 0))
    {
        erasedAlready[75] = 1;
        return (uint32_t)Bzero_Sector75_start;
    }
    else if((address >= Bzero_Sector76_start) &&
            (address < Bzero_Sector77_start) && (erasedAlready[76] == 0))
    {
        erasedAlready[76] = 1;
        return (uint32_t)Bzero_Sector76_start;
    }
    else if((address >= Bzero_Sector77_start) &&
            (address < Bzero_Sector78_start) && (erasedAlready[77] == 0))
    {
        erasedAlready[77] = 1;
        return (uint32_t)Bzero_Sector77_start;
    }
    else if((address >= Bzero_Sector78_start) &&
            (address < Bzero_Sector79_start) && (erasedAlready[78] == 0))
    {
        erasedAlready[78] = 1;
        return (uint32_t)Bzero_Sector78_start;
    }
    else if((address >= Bzero_Sector79_start) &&
            (address < Bzero_Sector80_start) && (erasedAlready[79] == 0))
    {
        erasedAlready[79] = 1;
        return (uint32_t)Bzero_Sector79_start;
    }
    else if((address >= Bzero_Sector80_start) &&
            (address < Bzero_Sector81_start) && (erasedAlready[80] == 0))
    {
        erasedAlready[80] = 1;
        return (uint32_t)Bzero_Sector80_start;
    }
    else if((address >= Bzero_Sector81_start) &&
            (address < Bzero_Sector82_start) && (erasedAlready[81] == 0))
    {
        erasedAlready[81] = 1;
        return (uint32_t)Bzero_Sector81_start;
    }
    else if((address >= Bzero_Sector82_start) &&
            (address < Bzero_Sector83_start) && (erasedAlready[82] == 0))
    {
        erasedAlready[82] = 1;
        return (uint32_t)Bzero_Sector82_start;
    }
    else if((address >= Bzero_Sector83_start) &&
            (address < Bzero_Sector84_start) && (erasedAlready[83] == 0))
    {
        erasedAlready[83] = 1;
        return (uint32_t)Bzero_Sector83_start;
    }
    else if((address >= Bzero_Sector84_start) &&
            (address < Bzero_Sector85_start) && (erasedAlready[84] == 0))
    {
        erasedAlready[84] = 1;
        return (uint32_t)Bzero_Sector84_start;
    }
    else if((address >= Bzero_Sector85_start) &&
            (address < Bzero_Sector86_start) && (erasedAlready[85] == 0))
    {
        erasedAlready[85] = 1;
        return (uint32_t)Bzero_Sector85_start;
    }
    else if((address >= Bzero_Sector86_start) &&
            (address < Bzero_Sector87_start) && (erasedAlready[86] == 0))
    {
        erasedAlready[86] = 1;
        return (uint32_t)Bzero_Sector86_start;
    }
    else if((address >= Bzero_Sector87_start) &&
            (address < Bzero_Sector87_start) && (erasedAlready[87] == 0))
    {
        erasedAlready[87] = 1;
        return (uint32_t)Bzero_Sector87_start;
    }
    else if((address >= Bzero_Sector88_start) &&
            (address < Bzero_Sector89_start) && (erasedAlready[88] == 0))
    {
        erasedAlready[88] = 1;
        return (uint32_t)Bzero_Sector88_start;
    }
    else if((address >= Bzero_Sector89_start) &&
            (address < Bzero_Sector90_start) && (erasedAlready[89] == 0))
    {
        erasedAlready[89] = 1;
        return (uint32_t)Bzero_Sector89_start;
    }
    else if((address >= Bzero_Sector90_start) &&
            (address < Bzero_Sector91_start) && (erasedAlready[90] == 0))
    {
        erasedAlready[90] = 1;
        return (uint32_t)Bzero_Sector90_start;
    }
    else if((address >= Bzero_Sector91_start) &&
            (address < Bzero_Sector92_start) && (erasedAlready[91] == 0))
    {
        erasedAlready[91] = 1;
        return (uint32_t)Bzero_Sector91_start;
    }
    else if((address >= Bzero_Sector92_start) &&
            (address < Bzero_Sector93_start) && (erasedAlready[92] == 0))
    {
        erasedAlready[92] = 1;
        return (uint32_t)Bzero_Sector92_start;
    }
    else if((address >= Bzero_Sector93_start) &&
            (address < Bzero_Sector94_start) && (erasedAlready[93] == 0))
    {
        erasedAlready[93] = 1;
        return (uint32_t)Bzero_Sector93_start;
    }
    else if((address >= Bzero_Sector94_start) &&
            (address < Bzero_Sector95_start) && (erasedAlready[94] == 0))
    {
        erasedAlready[94] = 1;
        return (uint32_t)Bzero_Sector94_start;
    }
    else if((address >= Bzero_Sector95_start) &&
            (address < Bzero_Sector96_start) && (erasedAlready[95] == 0))
    {
        erasedAlready[95] = 1;
        return (uint32_t)Bzero_Sector95_start;
    }
    else if((address >= Bzero_Sector96_start) &&
            (address < Bzero_Sector97_start) && (erasedAlready[96] == 0))
    {
        erasedAlready[96] = 1;
        return (uint32_t)Bzero_Sector96_start;
    }
    else if((address >= Bzero_Sector97_start) &&
            (address < Bzero_Sector98_start) && (erasedAlready[97] == 0))
    {
        erasedAlready[97] = 1;
        return (uint32_t)Bzero_Sector97_start;
    }
    else if((address >= Bzero_Sector98_start) &&
            (address < Bzero_Sector99_start) && (erasedAlready[98] == 0))
    {
        erasedAlready[99] = 1;
        return (uint32_t)Bzero_Sector99_start;
    }
    else if((address >= Bzero_Sector99_start) &&
            (address < Bzero_Sector100_start) && (erasedAlready[99] == 0))
    {
        erasedAlready[99] = 1;
        return (uint32_t)Bzero_Sector99_start;
    }
    else if((address >= Bzero_Sector100_start) &&
            (address < Bzero_Sector101_start) && (erasedAlready[100] == 0))
    {
        erasedAlready[100] = 1;
        return (uint32_t)Bzero_Sector100_start;
    }
    else if((address >= Bzero_Sector101_start) &&
            (address < Bzero_Sector102_start) && (erasedAlready[101] == 0))
    {
        erasedAlready[101] = 1;
        return (uint32_t)Bzero_Sector101_start;
    }
    else if((address >= Bzero_Sector102_start) &&
            (address < Bzero_Sector103_start) && (erasedAlready[102] == 0))
    {
        erasedAlready[102] = 1;
        return (uint32_t)Bzero_Sector102_start;
    }
    else if((address >= Bzero_Sector103_start) &&
            (address < Bzero_Sector104_start) && (erasedAlready[103] == 0))
    {
        erasedAlready[103] = 1;
        return (uint32_t)Bzero_Sector103_start;
    }
    else if((address >= Bzero_Sector104_start) &&
            (address < Bzero_Sector105_start) && (erasedAlready[104] == 0))
    {
        erasedAlready[104] = 1;
        return (uint32_t)Bzero_Sector104_start;
    }
    else if((address >= Bzero_Sector105_start) &&
            (address < Bzero_Sector106_start) && (erasedAlready[105] == 0))
    {
        erasedAlready[105] = 1;
        return (uint32_t)Bzero_Sector105_start;
    }
    else if((address >= Bzero_Sector106_start) &&
            (address < Bzero_Sector107_start) && (erasedAlready[106] == 0))
    {
        erasedAlready[106] = 1;
        return (uint32_t)Bzero_Sector106_start;
    }
    else if((address >= Bzero_Sector107_start) &&
            (address < Bzero_Sector108_start) && (erasedAlready[107] == 0))
    {
        erasedAlready[107] = 1;
        return (uint32_t)Bzero_Sector107_start;
    }
    else if((address >= Bzero_Sector108_start) &&
            (address < Bzero_Sector109_start) && (erasedAlready[108] == 0))
    {
        erasedAlready[108] = 1;
        return (uint32_t)Bzero_Sector108_start;
    }
    else if((address >= Bzero_Sector109_start) &&
            (address < Bzero_Sector110_start) && (erasedAlready[109] == 0))
    {
        erasedAlready[109] = 1;
        return (uint32_t)Bzero_Sector109_start;
    }
    else if((address >= Bzero_Sector110_start) &&
            (address < Bzero_Sector111_start) && (erasedAlready[110] == 0))
    {
        erasedAlready[110] = 1;
        return (uint32_t)Bzero_Sector110_start;
    }
    else if((address >= Bzero_Sector111_start) &&
            (address < Bzero_Sector112_start) && (erasedAlready[111] == 0))
    {
        erasedAlready[111] = 1;
        return (uint32_t)Bzero_Sector111_start;
    }
    else if((address >= Bzero_Sector112_start) &&
            (address < Bzero_Sector113_start) && (erasedAlready[112] == 0))
    {
        erasedAlready[112] = 1;
        return (uint32_t)Bzero_Sector112_start;
    }
    else if((address >= Bzero_Sector113_start) &&
            (address < Bzero_Sector114_start) && (erasedAlready[113] == 0))
    {
        erasedAlready[113] = 1;
        return (uint32_t)Bzero_Sector113_start;
    }
    else if((address >= Bzero_Sector114_start) &&
            (address < Bzero_Sector115_start) && (erasedAlready[114] == 0))
    {
        erasedAlready[114] = 1;
        return (uint32_t)Bzero_Sector114_start;
    }
    else if((address >= Bzero_Sector115_start) &&
            (address < Bzero_Sector116_start) && (erasedAlready[115] == 0))
    {
        erasedAlready[115] = 1;
        return (uint32_t)Bzero_Sector115_start;
    }
    else if((address >= Bzero_Sector116_start) &&
            (address < Bzero_Sector117_start) && (erasedAlready[116] == 0))
    {
        erasedAlready[116] = 1;
        return (uint32_t)Bzero_Sector116_start;
    }
    else if((address >= Bzero_Sector117_start) &&
            (address < Bzero_Sector118_start) && (erasedAlready[117] == 0))
    {
        erasedAlready[117] = 1;
        return (uint32_t)Bzero_Sector117_start;
    }
    else if((address >= Bzero_Sector118_start) &&
            (address < Bzero_Sector119_start) && (erasedAlready[118] == 0))
    {
        erasedAlready[118] = 1;
        return (uint32_t)Bzero_Sector118_start;
    }
    else if((address >= Bzero_Sector119_start) &&
            (address < Bzero_Sector120_start) && (erasedAlready[119] == 0))
    {
        erasedAlready[119] = 1;
        return (uint32_t)Bzero_Sector119_start;
    }
    else if((address >= Bzero_Sector120_start) &&
            (address < Bzero_Sector121_start) && (erasedAlready[120] == 0))
    {
        erasedAlready[120] = 1;
        return (uint32_t)Bzero_Sector120_start;
    }
    else if((address >= Bzero_Sector121_start) &&
            (address < Bzero_Sector122_start) && (erasedAlready[121] == 0))
    {
        erasedAlready[121] = 1;
        return (uint32_t)Bzero_Sector121_start;
    }
    else if((address >= Bzero_Sector122_start) &&
            (address < Bzero_Sector123_start) && (erasedAlready[122] == 0))
    {
        erasedAlready[122] = 1;
        return (uint32_t)Bzero_Sector122_start;
    }
    else if((address >= Bzero_Sector123_start) &&
            (address < Bzero_Sector124_start) && (erasedAlready[123] == 0))
    {
        erasedAlready[123] = 1;
        return (uint32_t)Bzero_Sector123_start;
    }
    else if((address >= Bzero_Sector124_start) &&
            (address < Bzero_Sector125_start) && (erasedAlready[124] == 0))
    {
        erasedAlready[124] = 1;
        return (uint32_t)Bzero_Sector124_start;
    }
    else if((address >= Bzero_Sector125_start) &&
            (address < Bzero_Sector126_start) && (erasedAlready[125] == 0))
    {
        erasedAlready[125] = 1;
        return (uint32_t)Bzero_Sector125_start;
    }
    else if((address >= Bzero_Sector126_start) &&
            (address < Bzero_Sector127_start) && (erasedAlready[126] == 0))
    {
        erasedAlready[126] = 1;
        return (uint32_t)Bzero_Sector126_start;
    }
    else if((address >= Bzero_Sector127_start) &&
            (address < FlashBank0EndAddress) && (erasedAlready[127] == 0))
    {
        erasedAlready[127] = 1;
        return (uint32_t)Bzero_Sector127_start;
    }
    else
    {
        return 0xdeadbeef; // a proxy address to signify that it is not
                           // a flash sector.
    }
}

//
// uint32_t findSize(uint32_t address) - This routine finds the size of the sector under use.
//
uint16_t findSize(uint32_t address)
{
    //
    // set erasedAlready, all sectors are 2K in 32 bits size;
    return Sector2KB_u32length;

