CraftifAI/Firmgen/ti_c2000_sdk/driverlib/f28p65x/examples/c28x_dual/flash_kernel/flash_kernel_c28x_dual_ex1_boot_cpu1.c
}

//
// uint32_t getLongData(void) - This routine fetches a 32-bit value from the peripheral
//                              input stream.
//
uint32_t getLongData()
{
    uint32_t longData;

    //
    // Fetch the upper 1/2 of the 32-bit value
    //
    longData = ( (uint32_t)(*getWordData)() << 16);

    //
    // Fetch the lower 1/2 of the 32-bit value
    //
    longData |= (uint32_t)(*getWordData)();

    return longData;
}

//
// readReservedFn - This function reads 8 reserved words in the header.
//                   None of these reserved words are used by the
//                   this boot loader at this time, they may be used in
//                   future devices for enhancements.  Loaders that use
//                   these words use their own read function.
//
void readReservedFn()
{
    uint16_t i;

    //
    // Read and discard the 8 reserved words.
    //
    for(i = 1; i <= 8; i++)
    {
       getWordData();
    }
    return;
}

void setFlashAPIError(Fapi_StatusType status)
{
    if(status == Fapi_Error_AsyncIncorrectDataBufferLength)
    {
        statusCode.flashAPIError = INCORRECT_DATA_BUFFER_LENGTH;
    }
    else if(status == Fapi_Error_AsyncIncorrectEccBufferLength)
    {
        statusCode.flashAPIError = INCORRECT_ECC_BUFFER_LENGTH;
    }
    else if(status == Fapi_Error_AsyncDataEccBufferLengthMismatch)
    {
        statusCode.flashAPIError = DATA_ECC_BUFFER_LENGTH_MISMATCH;
    }
    else if(status == Fapi_Error_FlashRegsNotWritable)
    {
        statusCode.flashAPIError = FLASH_REGS_NOT_WRITABLE;
    }
    else if(status == Fapi_Error_FeatureNotAvailable)
    {
        statusCode.flashAPIError = FEATURE_NOT_AVAILABLE;
    }
    else if(status == Fapi_Error_InvalidAddress)
    {
        statusCode.flashAPIError = INVALID_ADDRESS;
    }
    else if(status == Fapi_Error_InvalidCPUID)
    {
        statusCode.flashAPIError = INVALID_CPUID;
    }
    else if(status == Fapi_Error_Fail)
    {
        statusCode.flashAPIError = FAILURE;
    }
    else if(status == Fapi_Error_OtpChecksumMismatch){
        statusCode.flashAPIError = OTP_CHECKSUM_MISMATCH;
    }
    else if(status == Fapi_Error_InvalidDelayValue){
        statusCode.flashAPIError = INVALID_DELAY;
    }
    else if(status == Fapi_Error_InvalidHclkValue){
        statusCode.flashAPIError = INVALID_HCLK;
    }
    else if(status == Fapi_Error_InvalidCpu){
        statusCode.flashAPIError = INVALID_CPU;
    }
    else if(status == Fapi_Error_InvalidBank){
        statusCode.flashAPIError = INVALID_BANK;
    }
    else if(status == Fapi_Error_InvalidReadMode){
        statusCode.flashAPIError = INVALID_READ_MODE;
    }
    else
    {
        statusCode.status = NOT_RECOGNIZED;
    }
}
//
// End of file
//
